{
  "chapterId": "file1",
  "topicId": "topic5",
  "topicTitle": "المفتاح الأساسي والمفتاح الخارجي",
  "topicTitleEn": "Primary and Foreign Keys",
  "sections": [
    {
      "title": "المفتاح الأساسي (Primary Key)",
      "titleEn": "Primary Key",
      "subsections": [
        {
          "content": "المفتاح الأساسي هو عمود أو مجموعة أعمدة تميز كل سجل في الجدول بشكل فريد. لا يمكن أن يتكرر ولا يمكن أن يكون NULL.",
          "contentEn": "Primary key is a column or set of columns that uniquely identifies each record in a table. It cannot be duplicated and cannot be NULL.",
          "list": [
            "يميز كل سجل بشكل فريد",
            "لا يمكن أن يكون NULL",
            "لا يمكن أن يتكرر",
            "كل جدول يجب أن يحتوي على مفتاح أساسي واحد",
            "يُنشأ عليه Index تلقائياً"
          ],
          "listEn": [
            "Uniquely identifies each record",
            "Cannot be NULL",
            "Cannot be duplicated",
            "Each table must have one primary key",
            "Index created automatically on it"
          ],
          "listType": "ul",
          "highlight": {
            "title": "مثال",
            "titleEn": "Example",
            "content": "في جدول STUDENTS، عمود STUDENT_ID هو المفتاح الأساسي. كل طالب له رقم فريد مختلف عن الآخرين.",
            "contentEn": "In STUDENTS table, STUDENT_ID column is the primary key. Each student has a unique number different from others."
          }
        }
      ]
    },
    {
      "title": "المفتاح الخارجي (Foreign Key)",
      "titleEn": "Foreign Key",
      "subsections": [
        {
          "content": "المفتاح الخارجي هو عمود في جدول يشير إلى المفتاح الأساسي في جدول آخر. يستخدم لإنشاء العلاقات بين الجداول.",
          "contentEn": "Foreign key is a column in a table that refers to the primary key in another table. Used to create relationships between tables.",
          "list": [
            "يربط جدولين ببعضهما",
            "يشير إلى مفتاح أساسي في جدول آخر",
            "يمكن أن يكون NULL (إذا كانت العلاقة اختيارية)",
            "يمكن أن يتكرر",
            "يحافظ على سلامة البيانات (Referential Integrity)"
          ],
          "listEn": [
            "Links two tables together",
            "References primary key in another table",
            "Can be NULL (if relationship is optional)",
            "Can be duplicated",
            "Maintains referential integrity"
          ],
          "listType": "ul",
          "highlight": {
            "title": "مثال",
            "titleEn": "Example",
            "content": "في جدول ENROLLMENTS، عمود STUDENT_ID هو مفتاح خارجي يشير إلى STUDENT_ID في جدول STUDENTS.",
            "contentEn": "In ENROLLMENTS table, STUDENT_ID column is foreign key referencing STUDENT_ID in STUDENTS table."
          }
        }
      ]
    },
    {
      "title": "الفرق بين Primary Key و Foreign Key",
      "titleEn": "Difference Between Primary and Foreign Keys",
      "subsections": [
        {
          "list": [
            "Primary Key: يميز السجلات، فريد، لا يكرر، لا يكون NULL",
            "Foreign Key: يربط الجداول، يشير لـ PK آخر، يمكن أن يكرر، يمكن أن يكون NULL",
            "Primary Key: جدول واحد فقط له PK واحد",
            "Foreign Key: جدول يمكن أن يحتوي على عدة FK",
            "Primary Key: ينشأ عليه Index تلقائياً",
            "Foreign Key: لا ينشأ عليه Index تلقائياً (لكن يُنصح بإنشائه)"
          ],
          "listEn": [
            "Primary Key: Identifies records, unique, no duplicates, not NULL",
            "Foreign Key: Links tables, references another PK, can duplicate, can be NULL",
            "Primary Key: One table has only one PK",
            "Foreign Key: Table can have multiple FK",
            "Primary Key: Index created automatically",
            "Foreign Key: Index not created automatically (but recommended)"
          ],
          "listType": "ul"
        }
      ]
    },
    {
      "title": "Referential Integrity (سلامة المراجع)",
      "titleEn": "Referential Integrity",
      "subsections": [
        {
          "content": "سلامة المراجع هي قاعدة تضمن أن العلاقات بين الجداول تظل صحيحة ومتسقة.",
          "contentEn": "Referential integrity is a rule ensuring relationships between tables remain valid and consistent.",
          "list": [
            "لا يمكن إدخال قيمة FK لا توجد في جدول الـ PK",
            "لا يمكن حذف سجل من جدول الـ PK إذا كان مرتبط بسجلات في جدول الـ FK",
            "لا يمكن تعديل قيمة PK إذا كانت مستخدمة كـ FK",
            "يحمي من الأخطاء ويحافظ على اتساق البيانات"
          ],
          "listEn": [
            "Cannot insert FK value that doesn't exist in PK table",
            "Cannot delete record from PK table if linked to records in FK table",
            "Cannot modify PK value if used as FK",
            "Protects from errors and maintains data consistency"
          ],
          "listType": "ul",
          "highlight": {
            "title": "مثال على الحماية",
            "titleEn": "Protection Example",
            "content": "إذا حاولت حذف طالب من جدول STUDENTS وهو مسجل في مواد في جدول ENROLLMENTS، قاعدة البيانات ترفض الحذف.",
            "contentEn": "If you try to delete a student from STUDENTS table who is enrolled in courses in ENROLLMENTS table, database rejects the deletion."
          }
        }
      ]
    },
    {
      "title": "Composite Key (المفتاح المركب)",
      "titleEn": "Composite Key",
      "subsections": [
        {
          "content": "المفتاح المركب هو مفتاح أساسي يتكون من عمودين أو أكثر معاً لتمييز السجلات.",
          "contentEn": "Composite key is a primary key consisting of two or more columns together to identify records.",
          "highlight": {
            "title": "مثال",
            "titleEn": "Example",
            "content": "في جدول ENROLLMENTS، المفتاح الأساسي هو (STUDENT_ID + COURSE_ID) معاً. نفس الطالب يمكن أن يسجل في عدة مواد، ونفس المادة يمكن أن يسجل فيها عدة طلاب، لكن الطالب + المادة معاً = فريد.",
            "contentEn": "In ENROLLMENTS table, primary key is (STUDENT_ID + COURSE_ID) together. Same student can register in multiple courses, same course can have multiple students, but student + course together = unique."
          }
        }
      ]
    },
    {
      "title": "ملخص سريع",
      "titleEn": "Quick Summary",
      "subsections": [
        {
          "content": "Primary Key = عمود فريد يميز السجلات، لا يكرر، لا يكون NULL. Foreign Key = عمود يربط جدولين، يشير لـ PK في جدول آخر. Referential Integrity = قواعد تحافظ على صحة العلاقات.",
          "contentEn": "Primary Key = unique column identifying records, no duplicates, not NULL. Foreign Key = column linking two tables, references PK in another table. Referential Integrity = rules maintaining relationship validity.",
          "highlight": {
            "title": "نصيحة للدراسة",
            "titleEn": "Study Tip",
            "content": "افهم الفرق الجوهري: PK يميز، FK يربط. احفظ خصائص كل منهما والفروق بينهما.",
            "contentEn": "Understand core difference: PK identifies, FK links. Memorize properties of each and differences between them."
          }
        }
      ]
    }
  ]
}
